/**
 * Created by hxsd on 2016/11/15.
 */
//引入
var http=require("http");
var path=require("path");
var express=require("express");
//express 方法
var app=express();
//资源与数据请求========================
//静态资源请求-----------------------------------
var staticPath=path.resolve(__dirname,"public");
app.use(express.static(staticPath));

/*var data=[
    {
        name:"假行曾",
        district:"[网易广东省深圳市手机网友]",
        time:1479663921,
        comment:'经常都会听到一句公益广告词：“国是千万家，有国才有家”。每次听后都觉得哪里似乎不对劲：既然“国是千万家”，那后半句应该是“有家才有国”才对，咋会“有国才有家”呢？否则“墙是千万砖，有墙才有砖”不也是对的了？但是这么毫无逻辑的混帐话，信的人却还不少。[wang you]',
        agreeNum:6056
    },
    {
        name:"十三年外贸十三个国家",
        district:"[网易天津市手机网友]",
        time:1476985021,
        comment:"这些国家我都去过并且工作原因经常去出差，其实我自己的小感 想就是一条：政府干事，我们抛开意识形态的因素就说政府的工作，给我的 最直观印象是这些国家的政府是真干事，比如一个人失业了他面试失败政府有相 关部门会问他为什么失败呢？是你简历写的不好么？那好我这有个免费培训你去学学吧提高一下 面试水平，是不是你发型不好啊，那好我这有免费设计发型的你去吧。目的只有一个帮助你就业！如此种种各种实干的部门都在帮助国民，这样老百姓其实思维就简单和统一了，不用操那么多闲心而我们中国呢老百姓必须是理财专家，中医养生专家，食物辨别专家，高超的司机修车专家，生孩子专家，育儿高手，拳击专家，安全反恐专家……",
        agreeNum:8131
    },
    {
        name:"假行曾2",
        district:"[网易广东省深圳市手机网友]",
        time:1479863421,
        comment:'经常都会听到一句公益广告词：“国是千万家，有国才有家”。每次听后都觉得哪里似乎不对劲：既然“国是千万家”，那后半句应该是“有家才有国”才对，咋会“有国才有家”呢？否则“墙是千万砖，有墙才有砖”不也是对的了？但是这么毫无逻辑的混帐话，信的人却还不少。[wang you]',
        agreeNum:376
    },
    {
        name:"十三个国家",
        district:"[网易天津市手机网友]",
        time:1476085021,
        comment:"这些国家我都是一条：政府干事，我们抛开意识形态的因素就说政府的工作，给我的 最直观印象是这些国家的政府是真干事，比如一个人失业了他面试失败政府有相 关部门会问他为什么失败呢？是你简历写的不好么？那好我这有个免费培训你去学学吧提高一下 面试水平，是不是你发型不好啊，那好我这有免费设计发型的你去吧。目的只有一个帮助你就业！如此种种各种实干的部门都在帮助国民，这样老百姓其实思维就简单和统一了，不用操那么多闲心而我们中国呢老百姓必须是理财专家，中医养生专家，食物辨别专家，高超的司机修车专家，生孩子专家，育儿高手，拳击专家，安全反恐专家……",
        agreeNum:2131
    },
    {
        name:"十三",
        district:"[网易天津市手机网友]",
        time:1476086021,
        comment:"我的 最直观印象了他面试失败政府有相 关部门会问他为什么失败呢？是你简历写的不好么？那好我这有个免费培训你去学学吧提高一下 面试水平，是不是你发型不好啊，那好我这有免费设计发型的你去吧。目的只有一个帮助你就业！如此种种各种实干的部门都在帮助国民，这样老百姓其实思维就简单和统一了，不用操那么多闲心而我们中国呢老百姓必须是理财专家，中医养生专家，食物辨别专家，高超的司机修车专家，生孩子专家，育儿高手，拳击专家，安全反恐专家……",
        agreeNum:5131
    },
    {
        name:"十三年外贸十三个国家2",
        district:"[网易天津市手机网友]",
        time:1476923821,
        comment:"这些国家我都去过并且工作原因经常去出差，其实我自己的小感 想就是一条：政府干事，我们抛开意识形态的因素就说政府的工作，给我的 最直观印象是这些国家的政府是真干事，比如一个人失业了他面试失败政府有相 关部门会问他为什么失败呢？是你简历写的不好么？那好我这有个免费培训你去学学吧提高一下 面试水平，是不是你发型不好啊，那好我这有免费设计发型的你去吧。目的只有一个帮助你就业！如此种种各种实干的部门都在帮助国民，这样老百姓其实思维就简单和统一了，不用操那么多闲心而我们中国呢老百姓必须是理财专家，中医养生专家，食物辨别专家，高超的司机修车专家，生孩子专家，育儿高手，拳击专家，安全反恐专家……",
        agreeNum:871
    },
    {
        name:"假行曾4",
        district:"[网易广东省深圳市手机网友]",
        time:1479963421,
        comment:'里似乎不对劲：既然“国是千万家”，那后半句应该是“有家才有国”才对，咋会“有国才有家”呢？否则“墙是千万砖，有墙才有砖”不也是对的了？但是这么毫无逻辑的混帐话，信的人却还不少。[wang you]',
        agreeNum:676
    }
];*/
// 评论数据请求------------------------------
app.get("/index",function(req,res){
    res.json(data);
});
//服务器=================================
http.createServer(app).listen(3840,function() {
    console.log("服务器正运行在3840端口...");
});